Gets the target solid geometry.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public Solid GetSolid()
  Visual Basic
Public Function GetSolid As Solid
  Visual C++
public:
Solid^ GetSolid()
 Return Value
 The solid geometry.
 See Also
  ElementIntersectsSolidFilter Class
  Autodesk.Revit.DB Namespace